openfoam2/OpenFOAM-2.3.x/tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet       { $:inlet.p; }
    outlet      { $:outlet.p; }
    staticWalls { $:wall.p; }
    movingWalls { $staticWalls; }

    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
}

// ************************************************************************* //
