openfoam2/OpenFOAM-2.3.x/tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/constant/boundaryConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "";
    object      caseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

calculated
{
    alphat
    {
        type            calculated;
        value           uniform 0;
    }
    mut
    {
        type            calculated;
        value           uniform 0;
    }
}

inlet
{
    p
    {
        type            zeroGradient;
    }
}

outlet
{
    p
    {
        type            totalPressure;
        value           uniform 1e5;
        p0              uniform 1e5;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1.4;
    }

    U
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    T
    {
        type            inletOutlet;
        inletValue      uniform $:outerInlet.T;
        value           $inletValue;
    }

    k
    {
        type            inletOutlet;
        inletValue      uniform $:innerInlet.k;
        value           $inletValue;
    }

    epsilon
    {
        type            inletOutlet;
        inletValue      uniform $:innerInlet.epsilon;
        value           $inletValue;
    }
}

wall
{
    p
    {
        type            zeroGradient;
    }

    U
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    T
    {
        type            zeroGradient;
    }

    k
    {
        type            compressible::kqRWallFunction;
        value           uniform $:innerInlet.k;
    }

    epsilon
    {
        type            compressible::epsilonWallFunction;
        value           uniform $:innerInlet.epsilon;
    }

    mut
    {
        type            mutkWallFunction;
        value           uniform 0;
    }

    alphat
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}

movingWall
{
    U
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
